# Hide Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane..::..Hide Method
DockablePane Class See Also
---
If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Hide()
```

Visual Basic
---
```text
Public Sub Hide
```

Visual C++
---
```text
public:
void Hide()
```

# See Also
DockablePane Class
Autodesk.Revit.UI Namespace